snlkuharlocal/src/InformationRegisters/ТокеныАвторизацииИСМП/ТокеныАвторизацииИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТокеныАвторизацииИСМП</name>
  <resources>
    <name>Токен</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокЭЦП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТокена</name>
    <comment>СУЗ, TrueAPI</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СУЗ</name>
    <type>
      <types>CatalogRef.СтанцииУправленияЗаказамиИСМП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/СтанцииУправленияЗаказамиИСМП/СтанцииУправленияЗаказамиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтанцииУправленияЗаказамиИСМП</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор соединения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>omsId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СУЗДляОУКЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ТокеныАвторизацииИСМП/ManagerModule.bsl
Функция СохранитьТокен(Токен, ТипТокена, Организация, ОтпечатокЭЦП, СУЗ = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		ЗаписатьВЛог("Получение токенов ЧЗ", "Не указана организация токена !", "Ошибка");
		Возврат Ложь; 
	КонецЕсли;
	
	Запись = РегистрыСведений.ТокеныАвторизацииИСМП.СоздатьМенеджерЗаписи();
	
	Запись.Организация 		= Организация;
	Запись.ТипТокена 		= ТипТокена;	
	Запись.Пользователь		= ПараметрыСеанса.Пользователь;
	Запись.СУЗ				= СУЗ;
	Запись.Токен 			= Новый ХранилищеЗначения(Токен);
	
	Запись.ДатаПолучения 	= ТекущаяДата();
	Запись.СрокДействия		= Запись.ДатаПолучения + СрокЖизниТокена(ТипТокена);
	
	Запись.РабочееМесто 	= ПараметрыСеанса.РабочееМестоКлиента;
	Запись.ОтпечатокЭЦП		= ОтпечатокЭЦП;
	
	Запись.Записать();
КонецФункции //СохранитьТокен(Токен, ТипТокена, Организация, ОтпечатокЭЦП, СУЗ = Неопределено) Экспорт

Функция СрокЖизниТокена(ТипТокена = "СУЗ")
	Возврат 5*60*60;
КонецФункции //СрокЖизниТокена(ТипТокена = "СУЗ")

Функция ПолучитьТокен(ТипТокена, Организация, Знач ОтпечатокЭЦП = Неопределено, Знач СУЗ = Неопределено, Пользователь = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	мПользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.Пользователь);
	
	Данные = Новый Структура("Токен,СУЗ,ОтпечатокЭЦП");
	
	Запись = РегистрыСведений.ТокеныАвторизацииИСМП.СоздатьМенеджерЗаписи();
	
	Запись.Организация 		= Организация;
	Запись.ТипТокена 		= ТипТокена;
	Запись.Пользователь 	= мПользователь;
	
	Если ТипТокена = "СУЗ" И НЕ ЗначениеЗаполнено(СУЗ) Тогда           
		рПолучения = Справочники.СтанцииУправленияЗаказамиИСМП.ПолучитьСузПользователя(Запись.Организация, Запись.Пользователь);
		Если рПолучения.Успешно Тогда
			СУЗ	= рПолучения.Данные;	
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
			Возврат Результат;
		КонецЕсли;		
	КонецЕсли;
	
	Запись.СУЗ = СУЗ;
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(Запись.Организация) И Запись.СрокДействия > (ТекущаяДата() + 60*60) Тогда		
		Токен				= Запись.Токен.Получить();
		
		Данные.Токен 		= Токен;
		Данные.СУЗ 			= Запись.СУЗ;
		Данные.ОтпечатокЭЦП = Запись.ОтпечатокЭЦП;
		
		// Ихсанов Д. А. Начало 31.03.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9280
		Если ЗначениеЗаполнено(Токен) Тогда
		// Ихсанов Д. А. Конец  31.03.2026
			Результат.Успешно = Истина;		
		// Ихсанов Д. А. Начало 31.03.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9280
		КонецЕсли;
		// Ихсанов Д. А. Конец  31.03.2026
	КонецЕсли;
	
	//Вариант проверки по каждому запросу......перенесено в АпиЧЗ - повторный запрос при ошибках
	Если НЕ Результат.Успешно Тогда 
		//++Данилова Е.В. 04.06.2026 0000000515 
		//при одновременном получении токена не поможет, закоммент. 
		
		//++Данилова Е.В. 06.03.2026 ASU-2740
		//++Данилова Е.В. 27.03.2026 исправление без задачи 
		//Если Запись.Выбран() Тогда 
		//	РезультатОтработки = ОтработкаБлокировкиТокена(Запись);
		//	Если НЕ РезультатОтработки.Успешно Тогда
		//		
		//		МаркировкаКС.ДобавитьОшибки(Результат, РезультатОтработки);	
		//		
		//	Иначе
		//		//--Данилова Е.В. 06.03.2026
		//		рПолучения = ПолучитьТокенВЧЗ(ТипТокена, Организация, ОтпечатокЭЦП, СУЗ);
		//		
		//		Если рПолучения.Успешно Тогда
		//			Данные = рПолучения.Данные;
		//			Результат.Успешно = Истина;
		//		Иначе
		//			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);			
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//--Данилова Е.В. 27.03.2026   	 
		
		рПолучения = ПолучитьТокенВЧЗ(ТипТокена, Организация, ОтпечатокЭЦП, СУЗ);
		
		Если рПолучения.Успешно Тогда
			Данные = рПолучения.Данные;
			Результат.Успешно = Истина;
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);			
		КонецЕсли;
		//--Данилова Е.В. 04.06.2026 
	КонецЕсли;
	
	Результат.Данные = Данные;
	
	//+++Чирков 30.05.2026 отладка без задачи 
	Если НЕ ЗначениеЗаполнено(Данные.Токен) Тогда
		Результат.Ошибки.Добавить("Не удалось получить токен !");			
	КонецЕсли;
	//+++Чирков 30.05.2026 отладка без задачи
	
	Возврат Результат;
КонецФункции //ПолучитьТокен(ТипТокена, Организация, Знач ОтпечатокЭЦП = Неопределено, Знач СУЗ = Неопределено) Экспорт

Функция ПолучитьОтпечатокЭЦП(ТипТокена, Организация, Пользователь = Неопределено, Знач СУЗ = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	мПользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.Пользователь);
	
	Данные = Новый Структура("Токен,СУЗ,ОтпечатокЭЦП");
	
	Запись = РегистрыСведений.ТокеныАвторизацииИСМП.СоздатьМенеджерЗаписи();
	
	Запись.Организация 		= Организация;
	Запись.ТипТокена 		= ТипТокена;
	Запись.Пользователь 	= мПользователь;
	
	Если ТипТокена = "СУЗ" И НЕ ЗначениеЗаполнено(СУЗ) Тогда           
		рПолучения = Справочники.СтанцииУправленияЗаказамиИСМП.ПолучитьСузПользователя(Запись.Организация, Запись.Пользователь);
		Если рПолучения.Успешно Тогда
			СУЗ	= рПолучения.Данные;	
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
			Возврат Результат;
		КонецЕсли;		
	КонецЕсли;
	
	Запись.СУЗ = СУЗ;
	Запись.Прочитать();	
	
	Если ЗначениеЗаполнено(Запись.ОтпечатокЭЦП) Тогда
		Результат.Данные	= Запись.ОтпечатокЭЦП;
		Результат.Успешно	= Истина;		
	Иначе   
		ТекстОшибки = СтрШаблон("Не найден отпечаток ЭЦП для токена %1 ! Организация: '%2', пользователь: '%3', СУЗ: '%4'.", ТипТокена, Организация, СокрЛП(мПользователь), СУЗ);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьОтпечатокЭЦП(ТипТокена, Организация, Пользователь = Неопределено, Знач СУЗ = Неопределено) Экспорт

Функция ПолучитьТокенВЧЗ(ТипТокена, Организация, ОтпечатокЭЦП, СУЗ)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Данные = Новый Структура("Токен,СУЗ,ОтпечатокЭЦП");	
	
	ТекстСообщения = СтрШаблон("Запрос токена: %1, организация: %2, пользователь: %3, СУЗ: %4, отпечаток ЭЦП: %5.", 
		ТипТокена, Организация, СокрЛП(""+ПараметрыСеанса.Пользователь), СУЗ, ОтпечатокЭЦП);
	ЗаписатьВЛог("Токены ЧЗ", ТекстСообщения, "Отладка");
	
	//TO DO - странная логика -надо разобраться что там намудрили спаролями ЭЦП
	Если СтрНачинаетсяС(ВРег(СокрЛП("" + ПараметрыСеанса.Пользователь)), "AUTO") 
		ИЛИ (ЗначениеЗаполнено(СУЗ) И СУЗ.СУЗДляОУКЭП) Тогда
		ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ПарольДоступаКЗакрытомуКлючу", "");		
		ЗаписатьВЛог("Токены ЧЗ", "Сохранен пустой пароль доступа к закрытому ключу", "Отладка");
	Иначе
		
	КонецЕсли;
	
	ОбработкаАПИ = Обработки.АпиЧЗ.Создать();
			
	Если ТипТокена = "СУЗ" Тогда			
		Токен = ОбработкаАПИ.ПолучитьТокен_СУЗ(СУЗ, ОтпечатокЭЦП);	
	Иначе
		Токен = ОбработкаАПИ.ПолучитьТокен_TrueApi(ОтпечатокЭЦП, Организация);			
	КонецЕсли;
	
	Если ПустаяСтрока(Токен) Тогда 
		ТекстОшибки = СтрШаблон("Не удалось получить токен: %1 для организации: %2 !", ТипТокена, Организация);
		Результат.Ошибки.Добавить(ТекстОшибки);
	Иначе			
		СохранитьТокен(Токен, ТипТокена, Организация, ОтпечатокЭЦП, СУЗ);
		
		Данные.Токен		= Токен;
		Данные.СУЗ 			= СУЗ;
		Данные.ОтпечатокЭЦП	= ОтпечатокЭЦП;
		
		Результат.Успешно	= Истина;
	КонецЕсли;
	
	Результат.Данные = Данные;
	
	Возврат Результат;
КонецФункции // ()
//++Данилова Е.В. 06.03.2026
Функция ОтработкаБлокировкиТокена(Запись)
	
	Результат = МаркировкаКС.СтруктураРезультата(Истина); 
	Если ЗначениеЗаполнено(Запись.ДатаБлокировки) 
		И ТекущаяДата() - Запись.ДатаБлокировки < 1800 Тогда
		Результат.Успешно = Ложь; 
		Результат.Ошибки.Добавить("Получение токена заблокировано"); 
		ЗаписатьВЛог("Токены ЧЗ", "Получение токена заблокировано", "Отладка");
		Возврат Результат; 
	Иначе
		Запись.ДатаБлокировки = ТекущаяДатаСеанса(); 
		Запись.Записать(); 
		Возврат Результат; 
	КонецЕсли;	

КонецФункции // ()

//--Данилова Е.В. 06.03.2026
